app/views/events/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
				<td class="col-md-6 col-xs-6"><%= event.title %></td>
				<td><%= event.user.present? ? event.user.name : "n/a" %>, <%= time_ago_in_words(event.created_at) %> ago</td>