app/controllers/events_controller.rb

SELECT "events".* FROM "events"  ORDER BY "events"."created_at" DESC
---
  def index
    @events = Event.all

INSERT INTO "events" ("title", "description", "images", "street", "number", "district", "zip_code", "city", "estate", "country", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    respond_to do |format|
      if @event.save

UPDATE "events" SET "images" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["images", "Captura_de_tela_de_2015-11-22_21_26_13.png"], ["updated_at", "2015-12-28 02:55:45.534367"], ["id", 2]]
---
  def update

    respond_to do |format|
      if @event.update(event_params)