app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = ?, "unconfirmed_email" = ?, "confirmation_token" = ?, "confirmation_sent_at" = ? WHERE "users"."id" = ?
---
  def finish_signup
    if request.patch? && params[:user] #&& params[:user][:email]
      if current_user.update(user_params)