app/views/layouts/_navbar.html.erb

              <%= current_user.email_verified? ? image_tag(current_user.image) + current_user.name : "Carregando..."   %>
              <%= current_user.identities.size == 0 ? "" : "(via " + current_user.identities.map(&:provider).join("/").titleize + ")" %>
---
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "identities" WHERE "identities"."user_id" = ?  [["user_id", 1]]